---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.CanRotate
zh: 族实例
source: html/36f8d40d-6322-1cb8-a5e2-2215da9ce45e.htm
---
# Autodesk.Revit.DB.FamilyInstance.CanRotate Property

**中文**: 族实例

Property to test whether the family instance can be rotated by 180 degrees.

## Syntax (C#)
```csharp
public bool CanRotate { get; }
```